{
  "name": "Aryan Zaky Prayogo",
  "preferred_name": "Aryan",
  "date_of_birth": "25 August 2007",
  "place_of_birth": "Pasuruan, Indonesia",
  "role": "Aspiring DevSecOps Engineer • Computer Science",
  "headline": "Security • Automation • Reliability • Research",
  "summary": [
    "Hello! My name is Aryan Zaky Prayogo, an aspiring DevSecOps Engineer majoring in Computer Science at Brawijaya University. I’m passionate about cybersecurity, software development, and the intersection of technology and ethical leadership.",
    "I’ve earned 20+ awards spanning science, languages, research, and entrepreneurship. I’m active in youth organizations and academic communities focused on education, innovation, and sustainable development.",
  "I believe in continuous learning, meaningful collaboration, and using technology for good. Explore my journey, achievements, and projects here.",
  "Saya lahir dengan nama Aryan Zaky Prayogo pada hari Sabtu, 25 Agustus 2007, di sebuah desa kecil di Kabupaten Pasuruan. Saat itu, keluarga kami belum memiliki rumah sendiri, sehingga saya dilahirkan di sebuah klinik sederhana di desa kediaman nenek. Kehangatan suasana desa menjadi saksi awal kehidupan saya sebagai anak pertama dari tiga bersaudara. Sejak kecil, saya menyadari bahwa menjadi anak sulung berarti harus menjadi teladan bukan hanya dalam sikap, tetapi juga dalam cara menghadapi kehidupan. Sebagai bagian dari generasi muda yang memegang peran penting dalam masa depan bangsa, saya memiliki tekad kuat untuk turut mengatasi berbagai tantangan yang menghambat kemajuan Indonesia. Langkah awal yang akan saya tempuh adalah mengembangkan potensi diri melalui pendidikan setinggi mungkin, lalu memanfaatkan ilmu dan pengalaman yang saya peroleh untuk ikut berperan dalam meningkatkan kualitas pembangunan masyarakat Indonesia.",
  "Perjalanan pendidikan saya dimulai di SDN Wates 3, di mana sejak duduk di bangku sekolah dasar saya sudah terbiasa terlibat dalam berbagai lomba akademik maupun non-akademik. Salah satu kenangan paling berkesan adalah ketika saya dan tim memenangkan juara pertama dalam kompetisi pawai yang diselenggarakan oleh Kota Mojokerto—kemenangan yang mengajarkan saya tentang arti kerja sama, kreativitas, dan semangat untuk memberikan yang terbaik. Memasuki masa SMP di SMPN 5 Mojokerto, saya mulai aktif menjelajahi berbagai peluang baik dari dalam maupun luar sekolah, mulai dari OSIS hingga Palang Merah Remaja yang membantu saya memahami pentingnya kepedulian dan kerja kolektif. Namun, pengalaman yang paling membekas justru datang saat bergabung dengan Klub Robotik sekolah, di mana melalui proyek-proyek sederhana yang kami kerjakan bersama, saya mulai memahami bahwa teknologi bukan sekadar soal alat canggih, melainkan tentang bagaimana berpikir sistematis, bekerja sama dalam tim, dan mencari solusi untuk menyelesaikan masalah nyata. Dari situlah ketertarikan saya pada dunia teknologi tumbuh secara alami, sementara di tengah aktivitas organisasi dan ekstrakurikuler tersebut, saya tetap menjaga fokus akademik melalui partisipasi dalam olimpiade MIPA sebagai ruang untuk terus mengasah logika dan kemampuan berpikir kritis.",
  "Berlanjut ke tahap berikutnya, saya melanjutkan pendidikan di SMA Negeri 1 Singosari. Saya semakin serius memperluas ruang kontribusi, baik dalam pengembangan diri maupun keterlibatan sosial. Saya dipercaya memimpin Olympiad Club sebagai ketua, dan itu menjadi titik awal kesadaran saya bahwa potensi diri bisa benar-benar berkembang saat kita diberi tanggung jawab dan kepercayaan. Di luar itu, saya aktif di berbagai organisasi mulai dari lingkup sekolah hingga internasional seperti Badan Dakwah Islam (BDI), English Club (EC), Biologi Science Club (BSC), hingga ASEAN Youth Organization (AYO) dan SDG7 Youth Constituency. Kegiatan ini memperkaya cara saya berpikir, bekerja sama, dan berkontribusi.",
  "Namun, satu pengalaman yang paling banyak mengubah cara pandang saya adalah ketika saya terlibat dalam program Nutrition Goes To School (NGTS). Waktu itu, kami turun langsung ke sekolah-sekolah untuk memberi edukasi soal gizi dan kesehatan remaja. Saya bertugas sebagai Duta Gizi, dan di lapangan saya melihat langsung betapa banyak siswa yang mengalami stunting ringan tapi tidak menyadarinya. Salah satu siswa bahkan berkata, ‘Aku kira pendek itu cuma karena dari faktor keturunan.’ Di momen itu, saya sadar: teknologi, data, dan ilmu pengetahuan tidak akan berarti kalau tidak menyentuh hidup manusia secara nyata. Dari sanalah saya mulai menaruh perhatian lebih besar pada isu-isu kesehatan masyarakat dan pentingnya literasi berbasis teknologi yang etis dan berempati.",
  "Refleksi ini kemudian saya tuangkan dalam karya ilmiah berjudul ‘Gen-YAWS (Youth Awareness of Stunting): Optimalisasi Edukasi dan Pemberdayaan Remaja Untuk Mewujudkan Zero New Stunting Di Jawa Timur’, yang berangkat dari keprihatinan saya terhadap rendahnya literasi gizi di kalangan remaja dan kurangnya keterlibatan aktif mereka dalam isu kesehatan masyarakat. Karya ini mengusung gagasan bahwa remaja bukan hanya objek edukasi, tetapi juga bisa menjadi agen perubahan yang menjangkau sesama dengan bahasa yang lebih dekat, lebih mengena, dan lebih efektif. Dalam karya ini, saya mencoba merancang pendekatan edukatif yang kolaboratif, berbasis komunitas, dan didukung oleh pemanfaatan teknologi digital sederhana untuk memperluas jangkauan informasi. Bagi saya, teknologi bukan hanya alat, tapi jembatan untuk menghadirkan perubahan dan perubahan itu harus dimulai dari pemahaman karakter, empati, dan nilai kemanusiaan.",
  "Pemahaman inilah yang akhirnya mengukuhkan pilihan saya untuk melanjutkan studi di Program Studi Teknik Informatika, Universitas Brawijaya. Ketertarikan terhadap dunia teknologi, khususnya dalam hal keamanan digital dan rekayasa perangkat lunak, sebenarnya sudah tumbuh sejak masa SMP seiring dengan meningkatnya kesadaran saya akan dampak teknologi dalam kehidupan sehari-hari. Namun, pengalaman langsung di lapangan serta keterlibatan saya dalam riset-riset sosial memperluas perspektif tersebut. Saya mulai memandang teknologi bukan semata-mata sebagai produk atau alat teknis, melainkan sebagai medium transformasi sosial yang harus didekati dengan tanggung jawab etis dan kepedulian terhadap nilai-nilai kemanusiaan."
  ]
}
